#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
/* automatically generated by rust-bindgen 0.70.1 */

pub type ImgUint32 = ::std::os::raw::c_uint;
pub type ImgBool = ::std::os::raw::c_int;
pub type IMG_CHAR = ::std::os::raw::c_char;
pub type IMG_FLOAT = f32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PVRSRV_PSP2_APPHINT_ {
    pub ui32PDSFragBufferSize: ImgUint32,
    pub ui32ParamBufferSize: ImgUint32,
    pub ui32DriverMemorySize: ImgUint32,
    pub ui32ExternalZBufferMode: ImgUint32,
    pub ui32ExternalZBufferXSize: ImgUint32,
    pub ui32ExternalZBufferYSize: ImgUint32,
    pub bDumpProfileData: ImgBool,
    pub ui32ProfileStartFrame: ImgUint32,
    pub ui32ProfileEndFrame: ImgUint32,
    pub bDisableMetricsOutput: ImgBool,
    pub szWindowSystem: [IMG_CHAR; 256usize],
    pub szGLES1: [IMG_CHAR; 256usize],
    pub szGLES2: [IMG_CHAR; 256usize],
    pub bFBODepthDiscard: ImgBool,
    pub bOptimisedValidation: ImgBool,
    pub bDisableHWTQTextureUpload: ImgBool,
    pub bDisableHWTQNormalBlit: ImgBool,
    pub bDisableHWTQBufferBlit: ImgBool,
    pub bDisableHWTQMipGen: ImgBool,
    pub bDisableHWTextureUpload: ImgBool,
    pub ui32FlushBehaviour: ImgUint32,
    pub bEnableStaticPDSVertex: ImgBool,
    pub bEnableStaticMTECopy: ImgBool,
    pub bDisableStaticPDSPixelSAProgram: ImgBool,
    pub bDisableUSEASMOPT: ImgBool,
    pub bDumpShaders: ImgBool,
    pub ui32DefaultVertexBufferSize: ImgUint32,
    pub ui32MaxVertexBufferSize: ImgUint32,
    pub ui32DefaultIndexBufferSize: ImgUint32,
    pub ui32DefaultPDSVertBufferSize: ImgUint32,
    pub ui32DefaultPregenPDSVertBufferSize: ImgUint32,
    pub ui32DefaultPregenMTECopyBufferSize: ImgUint32,
    pub ui32DefaultVDMBufferSize: ImgUint32,
    pub bEnableMemorySpeedTest: ImgBool,
    pub bEnableAppTextureDependency: ImgBool,
    pub ui32UNCTexHeapSize: ImgUint32,
    pub ui32CDRAMTexHeapSize: ImgUint32,
    pub bEnableUNCAutoExtend: ImgBool,
    pub bEnableCDRAMAutoExtend: ImgBool,
    pub ui32SwTexOpThreadNum: ImgUint32,
    pub ui32SwTexOpThreadPriority: ImgUint32,
    pub ui32SwTexOpThreadAffinity: ImgUint32,
    pub ui32SwTexOpMaxUltNum: ImgUint32,
    pub ui32SwTexOpCleanupDelay: ImgUint32,
    pub ui32PrimitiveSplitThreshold: ImgUint32,
    pub ui32MaxDrawCallsPerCore: ImgUint32,
    pub ui32AdjustShaderPrecision: ImgUint32,
    pub bDumpCompilerLogFiles: ImgBool,
    pub bStrictBinaryVersionComparison: ImgBool,
    pub fPolygonUnitsMultiplier: IMG_FLOAT,
    pub fPolygonFactorMultiplier: IMG_FLOAT,
    pub bDumpUSPOutput: ImgBool,
    pub bDumpShaderAnalysis: ImgBool,
    pub bTrackUSCMemory: ImgBool,
    pub ui32OverloadTexLayout: ImgUint32,
    pub bInitialiseVSOutputs: ImgBool,
    pub ui32TriangleSplitPixelThreshold: ImgUint32,
    pub bDynamicSplitCalc: ImgBool,
    pub bAllowTrilinearNPOT: ImgBool,
    pub bEnableVaryingPrecisionOpt: ImgBool,
    pub bDisableAsyncTextureOp: ImgBool,
    pub ui32GLSLEnabledWarnings: ImgUint32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _PVRSRV_PSP2_APPHINT_"][::std::mem::size_of::<_PVRSRV_PSP2_APPHINT_>() - 1004usize];
    ["Alignment of _PVRSRV_PSP2_APPHINT_"]
        [::std::mem::align_of::<_PVRSRV_PSP2_APPHINT_>() - 4usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32PDSFragBufferSize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32PDSFragBufferSize) - 0usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32ParamBufferSize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32ParamBufferSize) - 4usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32DriverMemorySize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32DriverMemorySize) - 8usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32ExternalZBufferMode"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32ExternalZBufferMode) - 12usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32ExternalZBufferXSize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32ExternalZBufferXSize) - 16usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32ExternalZBufferYSize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32ExternalZBufferYSize) - 20usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDumpProfileData"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDumpProfileData) - 24usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32ProfileStartFrame"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32ProfileStartFrame) - 28usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32ProfileEndFrame"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32ProfileEndFrame) - 32usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDisableMetricsOutput"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDisableMetricsOutput) - 36usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::szWindowSystem"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, szWindowSystem) - 40usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::szGLES1"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, szGLES1) - 296usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::szGLES2"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, szGLES2) - 552usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bFBODepthDiscard"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bFBODepthDiscard) - 808usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bOptimisedValidation"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bOptimisedValidation) - 812usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDisableHWTQTextureUpload"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDisableHWTQTextureUpload) - 816usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDisableHWTQNormalBlit"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDisableHWTQNormalBlit) - 820usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDisableHWTQBufferBlit"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDisableHWTQBufferBlit) - 824usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDisableHWTQMipGen"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDisableHWTQMipGen) - 828usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDisableHWTextureUpload"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDisableHWTextureUpload) - 832usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32FlushBehaviour"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32FlushBehaviour) - 836usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bEnableStaticPDSVertex"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bEnableStaticPDSVertex) - 840usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bEnableStaticMTECopy"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bEnableStaticMTECopy) - 844usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDisableStaticPDSPixelSAProgram"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDisableStaticPDSPixelSAProgram) - 848usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDisableUSEASMOPT"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDisableUSEASMOPT) - 852usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDumpShaders"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDumpShaders) - 856usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32DefaultVertexBufferSize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32DefaultVertexBufferSize) - 860usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32MaxVertexBufferSize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32MaxVertexBufferSize) - 864usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32DefaultIndexBufferSize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32DefaultIndexBufferSize) - 868usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32DefaultPDSVertBufferSize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32DefaultPDSVertBufferSize) - 872usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32DefaultPregenPDSVertBufferSize"][::std::mem::offset_of!(
        _PVRSRV_PSP2_APPHINT_,
        ui32DefaultPregenPDSVertBufferSize
    ) - 876usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32DefaultPregenMTECopyBufferSize"][::std::mem::offset_of!(
        _PVRSRV_PSP2_APPHINT_,
        ui32DefaultPregenMTECopyBufferSize
    ) - 880usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32DefaultVDMBufferSize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32DefaultVDMBufferSize) - 884usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bEnableMemorySpeedTest"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bEnableMemorySpeedTest) - 888usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bEnableAppTextureDependency"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bEnableAppTextureDependency) - 892usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32UNCTexHeapSize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32UNCTexHeapSize) - 896usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32CDRAMTexHeapSize"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32CDRAMTexHeapSize) - 900usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bEnableUNCAutoExtend"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bEnableUNCAutoExtend) - 904usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bEnableCDRAMAutoExtend"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bEnableCDRAMAutoExtend) - 908usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32SwTexOpThreadNum"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32SwTexOpThreadNum) - 912usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32SwTexOpThreadPriority"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32SwTexOpThreadPriority) - 916usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32SwTexOpThreadAffinity"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32SwTexOpThreadAffinity) - 920usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32SwTexOpMaxUltNum"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32SwTexOpMaxUltNum) - 924usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32SwTexOpCleanupDelay"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32SwTexOpCleanupDelay) - 928usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32PrimitiveSplitThreshold"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32PrimitiveSplitThreshold) - 932usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32MaxDrawCallsPerCore"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32MaxDrawCallsPerCore) - 936usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32AdjustShaderPrecision"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32AdjustShaderPrecision) - 940usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDumpCompilerLogFiles"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDumpCompilerLogFiles) - 944usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bStrictBinaryVersionComparison"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bStrictBinaryVersionComparison) - 948usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::fPolygonUnitsMultiplier"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, fPolygonUnitsMultiplier) - 952usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::fPolygonFactorMultiplier"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, fPolygonFactorMultiplier) - 956usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDumpUSPOutput"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDumpUSPOutput) - 960usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDumpShaderAnalysis"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDumpShaderAnalysis) - 964usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bTrackUSCMemory"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bTrackUSCMemory) - 968usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32OverloadTexLayout"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32OverloadTexLayout) - 972usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bInitialiseVSOutputs"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bInitialiseVSOutputs) - 976usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32TriangleSplitPixelThreshold"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32TriangleSplitPixelThreshold) - 980usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDynamicSplitCalc"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDynamicSplitCalc) - 984usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bAllowTrilinearNPOT"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bAllowTrilinearNPOT) - 988usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bEnableVaryingPrecisionOpt"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bEnableVaryingPrecisionOpt) - 992usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::bDisableAsyncTextureOp"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, bDisableAsyncTextureOp) - 996usize];
    ["Offset of field: _PVRSRV_PSP2_APPHINT_::ui32GLSLEnabledWarnings"]
        [::std::mem::offset_of!(_PVRSRV_PSP2_APPHINT_, ui32GLSLEnabledWarnings) - 1000usize];
};
pub type PVRSRV_PSP2_APPHINT = _PVRSRV_PSP2_APPHINT_;

#[link(name = "gpu_es4_ext_stub", kind = "static")]
extern "C" {
    pub fn PVRSRVInitializeAppHint(psAppHint: *mut PVRSRV_PSP2_APPHINT) -> ::std::os::raw::c_uint;
    pub fn PVRSRVCreateVirtualAppHint(
        psAppHint: *mut PVRSRV_PSP2_APPHINT,
    ) -> ::std::os::raw::c_uint;
}
